deploy/backendadmin/lib/tasks/video_transcode.rake

  task :transcode, [:video_id] => :environment do |t, args|
    video = Video.find_by(video_id: args[:video_id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."video_id" = 'video_47d7b61dfc9d2e5a' LIMIT 1

    puts "Master playlist: /videos/hls/#{video.video_id}/master.m3u8"

    # Update video record
    video.update!(
      hls_ready: true,
      hls_path: "/videos/hls/#{video.video_id}/master.m3u8"
    )
---
UPDATE "videos" SET "updated_at" = '2025-09-14 03:56:51.712634', "hls_ready" = 1, "hls_path" = '/videos/hls/test_hls_video/master.m3u8' WHERE "videos"."id" = 2