deploy/backendadmin/lib/tasks/video_cleanup.rake

SELECT COUNT(*) FROM "videos"
SELECT COUNT(*) FROM "viewing_sessions"
---
  task stats: :environment do
    puts "\n📊 Video Statistics:"
    puts "=" * 40

    # Database stats
    puts "\nDatabase:"
    puts "  - Videos: #{Video.count}"
    puts "  - Viewing Sessions: #{ViewingSession.count}"